In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [48]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.135604 -0.302495  0.508887  1.057875
2013-01-02 -1.211219  2.059915 -0.607504 -0.364368
2013-01-03 -1.370994  1.561483  1.697325 -0.372056
2013-01-04  0.260818  0.272996 -0.054821  0.396957
2013-01-05 -0.890290 -0.647979  0.005863  0.666089
2013-01-06  0.321792 -1.204808 -0.850138  1.313126

In [49]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes   #check type

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head()

                   A         B         C         D
2013-01-01  1.188166  1.936653 -0.135570 -0.969041
2013-01-02  0.057450  0.764789 -0.677862  1.748152
2013-01-03  1.401250 -1.569760 -0.511365  0.079391
2013-01-04 -1.481473  1.810450 -1.209554 -1.674989
2013-01-05  0.212471  0.643593  0.804316 -0.481700

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.481473  1.810450 -1.209554 -1.674989
2013-01-05  0.212471  0.643593  0.804316 -0.481700
2013-01-06  2.233777 -0.083725 -0.481348  0.812896

In [9]:
df.index   #row's name

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns   #column's name

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values  #show values only

array([[ 1.18816603,  1.93665259, -0.13556962, -0.9690409 ],
       [ 0.05745024,  0.76478904, -0.67786227,  1.74815245],
       [ 1.40124966, -1.56975986, -0.5113653 ,  0.0793913 ],
       [-1.48147324,  1.81044977, -1.20955352, -1.67498875],
       [ 0.21247077,  0.64359301,  0.80431616, -0.48169992],
       [ 2.23377743, -0.08372476, -0.48134805,  0.81289632]])

In [12]:
df.describe()  #statistic summary

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.601940  0.583667 -0.368564 -0.080882
std    1.298785  1.300355  0.673198  1.237784
min   -1.481473 -1.569760 -1.209554 -1.674989
25%    0.096205  0.098105 -0.636238 -0.847206
50%    0.700318  0.704191 -0.496357 -0.201154
75%    1.347979  1.549035 -0.222014  0.629520
max    2.233777  1.936653  0.804316  1.748152

In [13]:
df.T   #matrix tranpose

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.188166    0.057450    1.401250   -1.481473    0.212471    2.233777
B    1.936653    0.764789   -1.569760    1.810450    0.643593   -0.083725
C   -0.135570   -0.677862   -0.511365   -1.209554    0.804316   -0.481348
D   -0.969041    1.748152    0.079391   -1.674989   -0.481700    0.812896

In [52]:
df.sort_index(axis=1, ascending=False)   #axis=1 column   axis=0 row

                   D         C         B         A
2013-01-01  1.057875  0.508887 -0.302495  1.135604
2013-01-02 -0.364368 -0.607504  2.059915 -1.211219
2013-01-03 -0.372056  1.697325  1.561483 -1.370994
2013-01-04  0.396957 -0.054821  0.272996  0.260818
2013-01-05  0.666089  0.005863 -0.647979 -0.890290
2013-01-06  1.313126 -0.850138 -1.204808  0.321792

In [15]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  1.401250 -1.569760 -0.511365  0.079391
2013-01-06  2.233777 -0.083725 -0.481348  0.812896
2013-01-05  0.212471  0.643593  0.804316 -0.481700
2013-01-02  0.057450  0.764789 -0.677862  1.748152
2013-01-04 -1.481473  1.810450 -1.209554 -1.674989
2013-01-01  1.188166  1.936653 -0.135570 -0.969041

# selection

In [16]:
df['A']

2013-01-01    1.188166
2013-01-02    0.057450
2013-01-03    1.401250
2013-01-04   -1.481473
2013-01-05    0.212471
2013-01-06    2.233777
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3]   #row data

                   A         B         C         D
2013-01-01  1.188166  1.936653 -0.135570 -0.969041
2013-01-02  0.057450  0.764789 -0.677862  1.748152
2013-01-03  1.401250 -1.569760 -0.511365  0.079391

# Select by label

In [18]:
df.loc[dates[0]]   #row 0

A    1.188166
B    1.936653
C   -0.135570
D   -0.969041
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:,['A','B']]   #all rows, column 'A' 'B'

                   A         B
2013-01-01  1.188166  1.936653
2013-01-02  0.057450  0.764789
2013-01-03  1.401250 -1.569760
2013-01-04 -1.481473  1.810450
2013-01-05  0.212471  0.643593
2013-01-06  2.233777 -0.083725

In [20]:
df.loc['20130102':'20130104',['A','B']]  #named row and column

                   A         B
2013-01-02  0.057450  0.764789
2013-01-03  1.401250 -1.569760
2013-01-04 -1.481473  1.810450

In [21]:
df.loc['20130102',['A','B']]

A    0.057450
B    0.764789
Name: 2013-01-02 00:00:00, dtype: float64

In [22]:
df.loc[dates[0],'A']

1.1881660266488938

In [23]:
df.at[dates[0],'A']   #same as previous

1.1881660266488938

# select by position

In [24]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.481473  1.810450
2013-01-05  0.212471  0.643593

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.057450 -0.677862
2013-01-03  1.401250 -0.511365
2013-01-05  0.212471  0.804316

In [27]:
df.iloc[1:3,:]

                  A         B         C         D
2013-01-02  0.05745  0.764789 -0.677862  1.748152
2013-01-03  1.40125 -1.569760 -0.511365  0.079391

In [28]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.936653 -0.135570
2013-01-02  0.764789 -0.677862
2013-01-03 -1.569760 -0.511365
2013-01-04  1.810450 -1.209554
2013-01-05  0.643593  0.804316
2013-01-06 -0.083725 -0.481348

In [29]:
df.iloc[1,1]

0.76478904492870314

In [30]:
df.iat[1,1]   #same as previous

0.76478904492870314

# Boolean Indexing

In [53]:
df[df.A > 0]   # data of A > 0

                   A         B         C         D
2013-01-01  1.135604 -0.302495  0.508887  1.057875
2013-01-04  0.260818  0.272996 -0.054821  0.396957
2013-01-06  0.321792 -1.204808 -0.850138  1.313126

In [54]:
df[df > 0]   #data with value > 0

                   A         B         C         D
2013-01-01  1.135604       NaN  0.508887  1.057875
2013-01-02       NaN  2.059915       NaN       NaN
2013-01-03       NaN  1.561483  1.697325       NaN
2013-01-04  0.260818  0.272996       NaN  0.396957
2013-01-05       NaN       NaN  0.005863  0.666089
2013-01-06  0.321792       NaN       NaN  1.313126

In [55]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']    #add a column
df2

                   A         B         C         D      E
2013-01-01  1.135604 -0.302495  0.508887  1.057875    one
2013-01-02 -1.211219  2.059915 -0.607504 -0.364368    one
2013-01-03 -1.370994  1.561483  1.697325 -0.372056    two
2013-01-04  0.260818  0.272996 -0.054821  0.396957  three
2013-01-05 -0.890290 -0.647979  0.005863  0.666089   four
2013-01-06  0.321792 -1.204808 -0.850138  1.313126  three

In [56]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.370994  1.561483  1.697325 -0.372056   two
2013-01-05 -0.890290 -0.647979  0.005863  0.666089  four

# Setting

In [57]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [58]:
df['F'] = s1

In [59]:
df.at[dates[0],'A'] = 0  #set according label value

In [60]:
df.iat[0,1] = 0     #set according value

In [63]:
df.loc[:,'D'] = np.array([5] * len(df))   #set a numpy array into column name

In [66]:
df2 = df.copy()
df2[df2 > 0] = -df2    #turn the value of 
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.508887  5  NaN
2013-01-02 -1.211219  2.059915 -0.607504  5  1.0
2013-01-03 -1.370994  1.561483  1.697325  5  2.0
2013-01-04  0.260818  0.272996 -0.054821  5  3.0
2013-01-05 -0.890290 -0.647979  0.005863  5  4.0
2013-01-06  0.321792 -1.204808 -0.850138  5  5.0

In [67]:
df2 = df.copy()
df2[df2 > 0] = -df2   #if value > 0 than turn positive into negative
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.508887 -5  NaN
2013-01-02 -1.211219 -2.059915 -0.607504 -5 -1.0
2013-01-03 -1.370994 -1.561483 -1.697325 -5 -2.0
2013-01-04 -0.260818 -0.272996 -0.054821 -5 -3.0
2013-01-05 -0.890290 -0.647979 -0.005863 -5 -4.0
2013-01-06 -0.321792 -1.204808 -0.850138 -5 -5.0

In [68]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.508887  5  NaN  1.0
2013-01-02 -1.211219  2.059915 -0.607504  5  1.0  1.0
2013-01-03 -1.370994  1.561483  1.697325  5  2.0  NaN
2013-01-04  0.260818  0.272996 -0.054821  5  3.0  NaN

# missing data

In [70]:
df1.dropna(how='any')   #drop the row if contain any NaN, same as df1.dropna()

                   A         B         C  D    F    E
2013-01-02 -1.211219  2.059915 -0.607504  5  1.0  1.0

In [71]:
df1.fillna(value=5)   #fill the NaN with choosen value

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.508887  5  5.0  1.0
2013-01-02 -1.211219  2.059915 -0.607504  5  1.0  1.0
2013-01-03 -1.370994  1.561483  1.697325  5  2.0  5.0
2013-01-04  0.260818  0.272996 -0.054821  5  3.0  5.0

In [72]:
pd.isnull(df1)   #if value is NaN, return true, else false

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# operation

In [73]:
df.mean() #mean of column

A   -0.481649
B    0.340268
C    0.116602
D    5.000000
F    3.000000
dtype: float64

In [74]:
df.mean(1)  #mean of row

2013-01-01    1.377222
2013-01-02    1.248238
2013-01-03    1.777563
2013-01-04    1.695799
2013-01-05    1.493519
2013-01-06    1.653369
Freq: D, dtype: float64

# apply function

In [76]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.508887   5   NaN
2013-01-02 -1.211219  2.059915 -0.098617  10   1.0
2013-01-03 -2.582213  3.621399  1.598709  15   3.0
2013-01-04 -2.321395  3.894394  1.543888  20   6.0
2013-01-05 -3.211685  3.246415  1.549751  25  10.0
2013-01-06 -2.889893  2.041607  0.699613  30  15.0

# merge and join

In [78]:
df = pd.DataFrame(np.random.randn(10, 4))
pieces = [df[:3], df[3:7], df[7:]]    #break df into 3 pieces
pd.concat(pieces)   #use concat to bring pieces into one data frame

          0         1         2         3
0  0.075153 -0.505745 -0.632161  0.766230
1 -0.616677  0.517268  1.979750 -1.082289
2  0.040148  0.176385 -1.246485 -0.472818
3 -1.283962 -1.872116 -0.496788 -0.206023
4  0.246290  0.326778 -0.818879  1.147879
5 -0.190879 -1.110799  0.677987 -0.377281
6 -0.601176  0.022882 -1.327070 -0.613706
7  1.884810  0.897093 -0.571653 -1.765940
8  0.360575  0.323608  0.031315 -0.388435
9 -1.438806 -1.894385 -1.529088 -1.111890

In [81]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
print(left)
print(right)

   key  lval
0  foo     1
1  bar     2
   key  rval
0  foo     4
1  bar     5

In [82]:
pd.merge(left, right, on='key')   #like SQL join

   key  lval  rval
0  foo     1     4
1  bar     2     5

# append new data

In [84]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])   #append new row
# if you want append a column, try tranpose it
df

          A         B         C         D
0 -1.465690  0.163503  0.528880  0.386406
1  1.343684 -2.165695 -0.001122 -0.065896
2  1.272282  1.622187  0.500139  0.050243
3 -0.329591  0.216570 -2.211243 -1.440844
4 -2.617644 -1.728187 -0.684228 -1.286855
5 -1.392404 -0.183599  1.044655 -1.023645
6 -0.300884  0.825081  1.157201  0.706214
7 -0.058190 -1.418188  0.179502 -0.084054

# group

In [85]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.732213  0.197237
1  bar    one -0.853592  0.932365
2  foo    two -0.836504 -0.635865
3  bar  three  2.129333 -1.022568
4  foo    two  0.179782 -1.577651
5  bar    two  0.066396  0.300020
6  foo    one  0.098809 -0.354762
7  foo  three -2.008656 -2.040727

In [86]:
df.groupby('A').sum()

            C         D
A
bar  1.342136  0.209817
foo -0.834357 -4.411769

In [87]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.853592  0.932365
    three  2.129333 -1.022568
    two    0.066396  0.300020
foo one    1.831022 -0.157525
    three -2.008656 -2.040727
    two   -0.656723 -2.213516

# reshaping

In [88]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])      #make tuples into index(row name)
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     0.209246 -0.736395
      two     1.504896 -0.140081
baz   one     0.045873 -0.781701
      two     0.832028 -0.779979
foo   one    -1.290113 -0.041462
      two    -0.789187  0.751126
qux   one     0.988058  1.561832
      two    -1.938554 -0.463458

In [90]:
stacked = df.stack()    #make column number into one
stacked

first  second
bar    one     A    0.209246
               B   -0.736395
       two     A    1.504896
               B   -0.140081
baz    one     A    0.045873
               B   -0.781701
       two     A    0.832028
               B   -0.779979
foo    one     A   -1.290113
               B   -0.041462
       two     A   -0.789187
               B    0.751126
qux    one     A    0.988058
               B    1.561832
       two     A   -1.938554
               B   -0.463458
dtype: float64

In [91]:
stacked.unstack()    #turn the stacked data into original data

                     A         B
first second
bar   one     0.209246 -0.736395
      two     1.504896 -0.140081
baz   one     0.045873 -0.781701
      two     0.832028 -0.779979
foo   one    -1.290113 -0.041462
      two    -0.789187  0.751126
qux   one     0.988058  1.561832
      two    -1.938554 -0.463458

# categoricals

In [94]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [97]:
df["grade"] = df["raw_grade"].astype("category")
print(df["grade"])
df

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [99]:
df["grade"].cat.categories = ["very good", "good", "very bad"]   #turn into different category
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

# pandas I/O

In [100]:
df.to_csv('foo.csv')   #ouput to csv

In [101]:
pd.read_csv('foo.csv')   #input from a csv

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

In [102]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')    #output ot xlsx

In [103]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])   #input from a xlsx

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

# DROP!!!!!

In [4]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

In [5]:
df.drop(['Cochice', 'Pima'])   #drop a row

            name  reports  year
Santa Cruz  Tina       31  2013
Maricopa    Jake        2  2014
Yuma         Amy        3  2014

In [6]:
df.drop('reports', axis=1)   #drop a column  axis=1 ==> column  axis=0 ==> row

             name  year
Cochice     Jason  2012
Pima        Molly  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

In [7]:
df.drop(df.index[2])  #drop a row by index

           name  reports  year
Cochice   Jason        4  2012
Pima      Molly       24  2012
Maricopa   Jake        2  2014
Yuma        Amy        3  2014

In [8]:
df.drop(df.columns[2], axis = 1)    #drop a column by index

             name  reports
Cochice     Jason        4
Pima        Molly       24
Santa Cruz   Tina       31
Maricopa     Jake        2
Yuma          Amy        3

In [45]:
df.drop(df.index[[2,3]])  #drop a range

          name  reports  year
Cochice  Jason        4  2012
Pima     Molly       24  2012
Yuma       Amy        3  2014

In [46]:
df.drop(df.index[-2])

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Yuma          Amy        3  2014

# Drop a row if it contains a certain value (in this case, "Tina")

In [38]:
df = df[df.name != 'Tina']  #挑出有Tina以外的row後，另存到新的位置

In [39]:
df

           name  reports  year
Cochice   Jason        4  2012
Pima      Molly       24  2012
Maricopa   Jake        2  2014
Yuma        Amy        3  2014

# for more information

http://pandas.pydata.org/pandas-docs/stable/10min.html